In [3]:
import pandas as pd

data = {'Name': ['Nikhil', 'Karthik', 'Nithik', 'Sanjay', 'Akash', 'Pavan'],
        'Age': [22, 26, 23, 23, 22, 27]}
df = pd.DataFrame(data)
df

      Name  Age
0   Nikhil   22
1  Karthik   26
2   Nithik   23
3   Sanjay   23
4    Akash   22
5    Pavan   27

### Display the first few rows of the DataFrame

In [4]:
df.head()

      Name  Age
0   Nikhil   22
1  Karthik   26
2   Nithik   23
3   Sanjay   23
4    Akash   22

### Display the last few rows of the DataFrame

In [5]:
df.tail()

      Name  Age
1  Karthik   26
2   Nithik   23
3   Sanjay   23
4    Akash   22
5    Pavan   27

### Get the DataFrame shape (rows, columns)

In [6]:
df.shape

(6, 2)

### Get a summary of the DataFrame

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

### Describe numerical columns in the DataFrame

In [8]:
df.describe()

             Age
count   6.000000
mean   23.833333
std     2.136976
min    22.000000
25%    22.250000
50%    23.000000
75%    25.250000
max    27.000000

### Select the 'Name' column

In [9]:
df['Name']

0     Nikhil
1    Karthik
2     Nithik
3     Sanjay
4      Akash
5      Pavan
Name: Name, dtype: object

### Select multiple columns ('Name' and 'Age')

In [10]:
df[['Name', 'Age']]

      Name  Age
0   Nikhil   22
1  Karthik   26
2   Nithik   23
3   Sanjay   23
4    Akash   22
5    Pavan   27

### Filter rows where Age is greater than 23

In [11]:
df[df['Age'] > 23]

      Name  Age
1  Karthik   26
5    Pavan   27

### Filter rows where Age is equal to 22

In [12]:
df[df['Age'] == 22]

     Name  Age
0  Nikhil   22
4   Akash   22

### Add a new column 'Gender' with default values

In [13]:
df['Gender'] = ['Male', 'Male', 'Male', 'Male', 'Male', 'Male']
df

      Name  Age Gender
0   Nikhil   22   Male
1  Karthik   26   Male
2   Nithik   23   Male
3   Sanjay   23   Male
4    Akash   22   Male
5    Pavan   27   Male

### Update values in a column (e.g., change Age of index 0)

In [14]:
df.at[0, 'Age'] = 25
df

      Name  Age Gender
0   Nikhil   25   Male
1  Karthik   26   Male
2   Nithik   23   Male
3   Sanjay   23   Male
4    Akash   22   Male
5    Pavan   27   Male

### Sort DataFrame by 'Age'

In [15]:
df.sort_values(by='Age')

      Name  Age Gender
4    Akash   22   Male
2   Nithik   23   Male
3   Sanjay   23   Male
0   Nikhil   25   Male
1  Karthik   26   Male
5    Pavan   27   Male

### Sort DataFrame by 'Age' in descending order

In [16]:
df.sort_values(by='Age', ascending=False)

      Name  Age Gender
5    Pavan   27   Male
1  Karthik   26   Male
0   Nikhil   25   Male
2   Nithik   23   Male
3   Sanjay   23   Male
4    Akash   22   Male

### Check for missing values in the DataFrame

In [17]:
df.isnull().sum()

Name      0
Age       0
Gender    0
dtype: int64

### Rename the 'Age' column to 'Years'

In [18]:
df.rename(columns={'Age': 'Years'})

      Name  Years Gender
0   Nikhil     25   Male
1  Karthik     26   Male
2   Nithik     23   Male
3   Sanjay     23   Male
4    Akash     22   Male
5    Pavan     27   Male

### Reset the DataFrame index

In [19]:
df.reset_index(drop=True)

      Name  Age Gender
0   Nikhil   25   Male
1  Karthik   26   Male
2   Nithik   23   Male
3   Sanjay   23   Male
4    Akash   22   Male
5    Pavan   27   Male

### Drop a column (e.g., 'Gender')

In [20]:
df.drop(columns=['Gender'])

      Name  Age
0   Nikhil   25
1  Karthik   26
2   Nithik   23
3   Sanjay   23
4    Akash   22
5    Pavan   27

### Calculate the mean age

In [21]:
df['Age'].mean()

24.333333333333332

### Group by 'Age' and count

In [22]:
df.groupby('Age').size()

Age
22    1
23    2
25    1
26    1
27    1
dtype: int64